10/data/attachments/57aaf8553f1a3edc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>Douglas_leg_Actions_23107_8</nif:username>
            <nif:friendToBeAdded>soap_actions_74bf323d-e197-4daa-af3b-fd4e71150586</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>